results/ai-agent-continuous/logs/cpu-spike-logs/k6-cpu-spike-run5.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: -
        output: -

     scenarios: (100.00%) 1 scenario, 40 max VUs, 1m30s max duration (incl. graceful stop):
              * default: Up to 40 looping VUs for 1m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 04/40 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 04/40 VUs  0m01.0s/1m00.0s

running (0m02.0s), 08/40 VUs, 5 complete and 0 interrupted iterations
default   [   3% ] 08/40 VUs  0m02.0s/1m00.0s

running (0m03.0s), 12/40 VUs, 15 complete and 0 interrupted iterations
default   [   5% ] 12/40 VUs  0m03.0s/1m00.0s

running (0m04.0s), 16/40 VUs, 35 complete and 0 interrupted iterations
default   [   7% ] 16/40 VUs  0m04.0s/1m00.0s

running (0m05.0s), 20/40 VUs, 57 complete and 0 interrupted iterations
default   [   8% ] 20/40 VUs  0m05.0s/1m00.0s

running (0m06.0s), 24/40 VUs, 83 complete and 0 interrupted iterations
default   [  10% ] 24/40 VUs  0m06.0s/1m00.0s

running (0m07.0s), 28/40 VUs, 120 complete and 0 interrupted iterations
default   [  12% ] 28/40 VUs  0m07.0s/1m00.0s

running (0m08.0s), 32/40 VUs, 154 complete and 0 interrupted iterations
default   [  13% ] 32/40 VUs  0m08.0s/1m00.0s

running (0m09.0s), 36/40 VUs, 194 complete and 0 interrupted iterations
default   [  15% ] 36/40 VUs  0m09.0s/1m00.0s

running (0m10.0s), 39/40 VUs, 237 complete and 0 interrupted iterations
default   [  17% ] 39/40 VUs  0m10.0s/1m00.0s

running (0m11.0s), 40/40 VUs, 288 complete and 0 interrupted iterations
default   [  18% ] 40/40 VUs  0m11.0s/1m00.0s

running (0m12.0s), 40/40 VUs, 337 complete and 0 interrupted iterations
default   [  20% ] 40/40 VUs  0m12.0s/1m00.0s

running (0m13.0s), 40/40 VUs, 382 complete and 0 interrupted iterations
default   [  22% ] 40/40 VUs  0m13.0s/1m00.0s

running (0m14.0s), 40/40 VUs, 428 complete and 0 interrupted iterations
default   [  23% ] 40/40 VUs  0m14.0s/1m00.0s

running (0m15.0s), 40/40 VUs, 474 complete and 0 interrupted iterations
default   [  25% ] 40/40 VUs  0m15.0s/1m00.0s

running (0m16.0s), 40/40 VUs, 521 complete and 0 interrupted iterations
default   [  27% ] 40/40 VUs  0m16.0s/1m00.0s

running (0m17.0s), 40/40 VUs, 564 complete and 0 interrupted iterations
default   [  28% ] 40/40 VUs  0m17.0s/1m00.0s

running (0m18.0s), 40/40 VUs, 612 complete and 0 interrupted iterations
default   [  30% ] 40/40 VUs  0m18.0s/1m00.0s

running (0m19.0s), 40/40 VUs, 656 complete and 0 interrupted iterations
default   [  32% ] 40/40 VUs  0m19.0s/1m00.0s

running (0m20.0s), 40/40 VUs, 700 complete and 0 interrupted iterations
default   [  33% ] 40/40 VUs  0m20.0s/1m00.0s

running (0m21.0s), 40/40 VUs, 742 complete and 0 interrupted iterations
default   [  35% ] 40/40 VUs  0m21.0s/1m00.0s

running (0m22.0s), 40/40 VUs, 783 complete and 0 interrupted iterations
default   [  37% ] 40/40 VUs  0m22.0s/1m00.0s

running (0m23.0s), 40/40 VUs, 827 complete and 0 interrupted iterations
default   [  38% ] 40/40 VUs  0m23.0s/1m00.0s

running (0m24.0s), 40/40 VUs, 878 complete and 0 interrupted iterations
default   [  40% ] 40/40 VUs  0m24.0s/1m00.0s

running (0m25.0s), 40/40 VUs, 921 complete and 0 interrupted iterations
default   [  42% ] 40/40 VUs  0m25.0s/1m00.0s

running (0m26.0s), 40/40 VUs, 970 complete and 0 interrupted iterations
default   [  43% ] 40/40 VUs  0m26.0s/1m00.0s

running (0m27.0s), 40/40 VUs, 1021 complete and 0 interrupted iterations
default   [  45% ] 40/40 VUs  0m27.0s/1m00.0s

running (0m28.0s), 40/40 VUs, 1070 complete and 0 interrupted iterations
default   [  47% ] 40/40 VUs  0m28.0s/1m00.0s

running (0m29.0s), 40/40 VUs, 1120 complete and 0 interrupted iterations
default   [  48% ] 40/40 VUs  0m29.0s/1m00.0s

running (0m30.0s), 40/40 VUs, 1172 complete and 0 interrupted iterations
default   [  50% ] 40/40 VUs  0m30.0s/1m00.0s

running (0m31.0s), 40/40 VUs, 1220 complete and 0 interrupted iterations
default   [  52% ] 40/40 VUs  0m31.0s/1m00.0s

running (0m32.0s), 40/40 VUs, 1268 complete and 0 interrupted iterations
default   [  53% ] 40/40 VUs  0m32.0s/1m00.0s

running (0m33.0s), 40/40 VUs, 1309 complete and 0 interrupted iterations
default   [  55% ] 40/40 VUs  0m33.0s/1m00.0s

running (0m34.0s), 40/40 VUs, 1350 complete and 0 interrupted iterations
default   [  57% ] 40/40 VUs  0m34.0s/1m00.0s

running (0m35.0s), 40/40 VUs, 1396 complete and 0 interrupted iterations
default   [  58% ] 40/40 VUs  0m35.0s/1m00.0s

running (0m36.0s), 40/40 VUs, 1431 complete and 0 interrupted iterations
default   [  60% ] 40/40 VUs  0m36.0s/1m00.0s

running (0m37.0s), 40/40 VUs, 1470 complete and 0 interrupted iterations
default   [  62% ] 40/40 VUs  0m37.0s/1m00.0s

running (0m38.0s), 40/40 VUs, 1521 complete and 0 interrupted iterations
default   [  63% ] 40/40 VUs  0m38.0s/1m00.0s

running (0m39.0s), 40/40 VUs, 1566 complete and 0 interrupted iterations
default   [  65% ] 40/40 VUs  0m39.0s/1m00.0s

running (0m40.0s), 40/40 VUs, 1615 complete and 0 interrupted iterations
default   [  67% ] 40/40 VUs  0m40.0s/1m00.0s

running (0m41.0s), 40/40 VUs, 1659 complete and 0 interrupted iterations
default   [  68% ] 40/40 VUs  0m41.0s/1m00.0s

running (0m42.0s), 40/40 VUs, 1703 complete and 0 interrupted iterations
default   [  70% ] 40/40 VUs  0m42.0s/1m00.0s

running (0m43.0s), 40/40 VUs, 1743 complete and 0 interrupted iterations
default   [  72% ] 40/40 VUs  0m43.0s/1m00.0s

running (0m44.0s), 40/40 VUs, 1791 complete and 0 interrupted iterations
default   [  73% ] 40/40 VUs  0m44.0s/1m00.0s

running (0m45.0s), 40/40 VUs, 1835 complete and 0 interrupted iterations
default   [  75% ] 40/40 VUs  0m45.0s/1m00.0s

running (0m46.0s), 40/40 VUs, 1885 complete and 0 interrupted iterations
default   [  77% ] 40/40 VUs  0m46.0s/1m00.0s

running (0m47.0s), 40/40 VUs, 1938 complete and 0 interrupted iterations
default   [  78% ] 40/40 VUs  0m47.0s/1m00.0s

running (0m48.0s), 40/40 VUs, 1987 complete and 0 interrupted iterations
default   [  80% ] 40/40 VUs  0m48.0s/1m00.0s

running (0m49.0s), 40/40 VUs, 2034 complete and 0 interrupted iterations
default   [  82% ] 40/40 VUs  0m49.0s/1m00.0s

running (0m50.0s), 40/40 VUs, 2080 complete and 0 interrupted iterations
default   [  83% ] 40/40 VUs  0m50.0s/1m00.0s

running (0m51.0s), 39/40 VUs, 2129 complete and 0 interrupted iterations
default   [  85% ] 39/40 VUs  0m51.0s/1m00.0s

running (0m52.0s), 35/40 VUs, 2177 complete and 0 interrupted iterations
default   [  87% ] 35/40 VUs  0m52.0s/1m00.0s

running (0m53.0s), 29/40 VUs, 2225 complete and 0 interrupted iterations
default   [  88% ] 29/40 VUs  0m53.0s/1m00.0s

running (0m54.0s), 26/40 VUs, 2263 complete and 0 interrupted iterations
default   [  90% ] 26/40 VUs  0m54.0s/1m00.0s

running (0m55.0s), 22/40 VUs, 2302 complete and 0 interrupted iterations
default   [  92% ] 22/40 VUs  0m55.0s/1m00.0s

running (0m56.0s), 18/40 VUs, 2333 complete and 0 interrupted iterations
default   [  93% ] 18/40 VUs  0m56.0s/1m00.0s

running (0m57.0s), 15/40 VUs, 2357 complete and 0 interrupted iterations
default   [  95% ] 15/40 VUs  0m57.0s/1m00.0s

running (0m58.0s), 09/40 VUs, 2377 complete and 0 interrupted iterations
default   [  97% ] 09/40 VUs  0m58.0s/1m00.0s

running (0m59.0s), 06/40 VUs, 2390 complete and 0 interrupted iterations
default   [  98% ] 06/40 VUs  0m59.0s/1m00.0s

running (1m00.0s), 01/40 VUs, 2398 complete and 0 interrupted iterations
default   [ 100% ] 01/40 VUs  1m00.0s/1m00.0s


  █ TOTAL RESULTS 

    checks_total.......: 7197   119.426176/s
    checks_succeeded...: 66.66% 4798 out of 7197
    checks_failed......: 33.33% 2399 out of 7197

    ✓ Homepage loaded
    ✓ Added to cart
    ✗ Checkout successful
      ↳  0% — ✓ 0 / ✗ 2399

    HTTP
    http_req_duration..............: avg=197.08ms min=145.02ms med=189.1ms  max=922.43ms p(90)=247.53ms p(95)=277.91ms
      { expected_response:true }...: avg=200.37ms min=145.02ms med=189.79ms max=922.43ms p(90)=257.04ms p(95)=290.26ms
    http_req_failed................: 25.00% 2399 out of 9596
    http_reqs......................: 9596   159.234901/s

    EXECUTION
    iteration_duration.............: avg=841.61ms min=661.49ms med=822.29ms max=1.76s    p(90)=962.63ms p(95)=1s      
    iterations.....................: 2399   39.808725/s
    vus............................: 1      min=1            max=40
    vus_max........................: 40     min=40           max=40

    NETWORK
    data_received..................: 77 MB  1.3 MB/s
    data_sent......................: 2.4 MB 40 kB/s



running (1m00.3s), 00/40 VUs, 2399 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/40 VUs  1m0s